app/Controllers/Dokter.php

    public function index()
    {
        // Mengambil semua data
        $dokter = $this->dokterModel->findAll();
---
SELECT *
FROM `dokter`