app/Controllers/JadwalDokter.php

    public function index()
    {
        // Mengambil semua data
        $jadwaldokter = $this->jadwaldokterModel->findAll();
---
SELECT *
FROM `jadwal_dokter`

    public function tambah()
    {
        $dokterModel = new DokterModel();
        $dokter = $dokterModel->findAll();
---
SELECT *
FROM `dokter`

    public function simpan()
    {
        // Ambil id_dokter dari form
        $id_dokter = $this->request->getPost('id_dokter');

        // Ambil nama dokter berdasarkan id_dokter
        $dokterModel = new DokterModel();  // Pastikan Anda sudah membuat model untuk tabel dokter
        $dokter = $dokterModel->find($id_dokter);
        $nama = $dokter ? $dokter['nama'] : ''; // Pastikan dokter ditemukan

        // Data yang akan disimpan
        $data = [
            'id_dokter' => $id_dokter,  // Menyimpan id_dokter
            'nama' => $nama,     // Menyimpan nama dokter
            'tanggal' => $this->request->getPost('tanggal'),
            'jam_praktik' => $this->request->getPost('jam_praktik'),
        ];

        // Simpan data ke jadwal_dokter
        if ($this->jadwaldokterModel->insert($data)) {
---
INSERT INTO `jadwal_dokter` (`id_dokter`, `tanggal`, `jam_praktik`) VALUES ('4', '2003-01-02', '11:31')