app/Controllers/LaporanPenjualan.php

    public function index()
    {
        $search = $this->request->getGet('search'); // Ambil input pencarian dari query string
        $laporanpenjualanModel = new \App\Models\LaporanPenjualanModel(); // Pastikan Anda menggunakan model yang sesuai

        if ($search) {
            $laporan = $laporanpenjualanModel->like('nama', $search)
                ->orLike('jenis_kelamin', $search)
                ->findAll();
        } else {
            $laporan = $laporanpenjualanModel->findAll();
---
SELECT *
FROM `laporanpenjualan`