app/Controllers/Pelanggan.php

    public function index()
    {
        // Mengambil semua data
        $pelanggan = $this->pelangganModel->findAll();
---
SELECT *
FROM `pelanggan`