app/Controllers/PenjualanTreatment.php

SELECT *
FROM `pelanggan`
SELECT *
FROM `treatment`
SELECT *
FROM `dokter`
---
    public function edit($id)
    {
        $jualTreatmentModel = new \App\Models\JualTreatmentModel();
        $pelangganModel = new \App\Models\PelangganModel();
        $treatmentModel = new \App\Models\TreatmentModel();
        $dokterModel = new \App\Models\DokterModel();

        $data = [
            'title' => 'Edit Penjualan Treatment',
            'detail' => $jualTreatmentModel->find($id), // Data detail treatment berdasarkan ID
            'pelanggan' => $pelangganModel->findAll(),  // Semua data pelanggan
            'treatment' => $treatmentModel->findAll(),  // Semua data treatment
            'dokter' => $dokterModel->findAll(),        // Semua data dokter
        ];