app/Controllers/Produk.php

SELECT *
FROM `produk`
WHERE `produk`.`id_produk` = '2'
---
    public function update()
    {
        $id_produk = $this->request->getVar('id_produk'); // Pastikan menggunakan 'id' yang benar dari input hidden
        $data = [
            'kode_produk'   => $this->request->getVar('kode'),
            'nama'          => $this->request->getVar('nama'),
            'id_supplier'   => $this->request->getVar('id_supplier'), // Perbaiki dengan 'id_supplier'
            'harga_produk'  => $this->request->getVar('harga_produk'),
            'stok'          => $this->request->getVar('stok'),
            'diskon'        => $this->request->getVar('diskon'),
        ];

        // Pastikan data produk dengan id_produk tersebut ada
        if ($this->produkModel->find($id_produk)) {