app/Controllers/Supplier.php

SELECT *
FROM `supplier`
---
    public function index()
    {
        $search = $this->request->getGet('search'); // Ambil input pencarian dari query string
        $supplierModel = new \App\Models\SupplierModel(); // Pastikan Anda menggunakan model yang sesuai

        if ($search) {
            $supplier = $supplierModel->like('nama', $search)
                ->orLike('alamat', $search)
                ->findAll();
        } else {
            $supplier = $supplierModel->findAll();