app/Controllers/Treatment.php

    public function index()
    {
        // Mengambil semua data
        $treatment = $this->treatmentModel->findAll();
---
SELECT *
FROM `treatment`