app/Controllers/User.php

    public function index()
    {
        // Mengambil semua data
        $user = $this->userModel->findAll();
---
SELECT *
FROM `user`

    public function update($id_us)
    {
        $this->userModel->update($id_us, [
            'nama' => $this->request->getPost('nama'),
            'username' => $this->request->getPost('username'),
            'password' => $this->request->getPost('password'),
            'role' => $this->request->getPost('role'),
        ]);
---
UPDATE `user` SET `nama` = 'Dadang', `username` = 'Dadang23', `password` = 'pemilik123', `role` = 'pemilik'
WHERE `user`.`id_user` IN ('3')