app/Models/DashboardModel.php

    public function getTotalDokter()
    {
        return $this->db->table('dokter')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `dokter`

    public function getTotalProduk()
    {
        return $this->db->table('produk')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `produk`

    public function getTotalTreatment()
    {
        return $this->db->table('treatment')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `treatment`

    public function getTotalPelanggan()
    {
        return $this->db->table('pelanggan')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `pelanggan`

    public function getTotalSupplier()
    {
        return $this->db->table('supplier')->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `supplier`