app/Models/DetailProdukModel.php

    public function getDetailProduk()
    {
        // Join dengan tabel produk untuk mengambil nama produk yang baru (nama)
        return $this->select('detail_produk.*, produk.nama')
            ->join('produk', 'produk.id_produk = detail_produk.id_produk', 'left')
            ->findAll();
---
SELECT `detail_produk`.*, `produk`.`nama`
FROM `detail_produk`
LEFT JOIN `produk` ON `produk`.`id_produk` = `detail_produk`.`id_produk`

    public function getProduk()
    {
        return $this->db->table('produk')->get()->getResultArray();
---
SELECT *
FROM `produk`