app/Models/JadwalDokterModel.php

    public function getJadwalWithDokter()
    {
        return $this->db->table('jadwal_dokter')
            ->join('dokter', 'dokter.id_dokter = jadwal_dokter.id_dokter')
            ->select('jadwal_dokter.*, dokter.nama as dokter_name')
            ->get()
            ->getResultArray();
---
SELECT `jadwal_dokter`.*, `dokter`.`nama` as `dokter_name`
FROM `jadwal_dokter`
JOIN `dokter` ON `dokter`.`id_dokter` = `jadwal_dokter`.`id_dokter`