app/Models/ProdukModel.php

SELECT `produk`.*, `supplier`.`nama` as `supplier_name`
FROM `produk`
JOIN `supplier` ON `produk`.`id_supplier` = `supplier`.`id_supplier`
---
    public function getProdukWithSupplier()
    {
        return $this->db->table('produk')
            ->join('supplier', 'produk.id_supplier = supplier.id_supplier')
            ->select('produk.*, supplier.nama as supplier_name')
            ->get()
            ->getResultArray();